------------------------------------------
3.1 交互式输入
------------------------------------------
Abaqus脚本接口提供了3种交互式输入函数
1. getInput()
可以定义只包含标签项和1个文本输入框的对话框，在文本框中可以输入任何参数值，也可以为其指定默认值，
当按下Enter或OK键后，返回值将转换为字符串形式
详见脚本 getInput.py
2. getInputs()
允许在1个对话框中显示多个文本输入框
详细脚本 getInputs.py	getInputs_material.py
3. getWarningReply()
在主窗口中心位置显示警告对话框 
详见脚本 getWarningReply.py
------------------------------------------

------------------------------------------
3.2 创建材料库
------------------------------------------
生成宏文件-->在此基础上修改-->运行脚本在Property模块的Material Manager中自动出现所有用户自定义材料
1. 录制宏macro
Macro Manager... add --> 相关操作 --> Stop Recording --> 不必保存模型，直接退出Abaqus/CAE 
--> 修改生成的abaqusMacros.py
详见 3.2/material_library.py
------------------------------------------

------------------------------------------
3.3 创建插件程序
------------------------------------------
所有插件程序必须在abaqus_plugins文件夹中
1. 使用RSG对话框构造器创建对话框
Abaqus/CAE --> Plug-ins菜单 --> Abaqus --> RSG Dialog Builder
2. 创建并运行内核脚本
详见脚本 createPlateMoudle.py
------------------------------------------
